/*
Напишите программу, которая на вход принимает число и выдает его крадрат (число умноженное само на себя).
*/

System.Console.WriteLine("Введите число: "); //cw - быстрый вызов Console.Writeline
int userNumber = Convert.ToInt32(Console.ReadLine());
int result = userNumber * userNumber;
Console.WriteLine(result);
Console.WriteLine(userNumber*userNumber);
